src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ОбъектыТребующиеПолучения/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбработатьПереданныеПараметры();
	
	ЗаполнитьСписокВыбораОбъектыМетаданных();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСРезультатамиОбмена.ОбработатьСохраненныеНастройкиОтбораОбъектыМетаданныхПередЗагрузкой(
		Настройки, ДоступныеДляОтбораТипыОбъектов, ОбъектыМетаданныхОтбор, Список);
		
	НастройкиТипОтбораЗапросНаВыгрузку = Настройки.Получить("ТипОтбораЗапросНаВыгрузку");
	
	Если НастройкиТипОтбораЗапросНаВыгрузку <> Неопределено Тогда
		
		ТипОтбораЗапросНаВыгрузку = НастройкиТипОтбораЗапросНаВыгрузку;
		
		НастройкиДатаОтправкиЗапросаНаВыгрузку = Настройки.Получить("ДатаОтправкиЗапросаНаВыгрузку");
		
		Если НастройкиДатаОтправкиЗапросаНаВыгрузку <> Неопределено Тогда
			
			ДатаОтправкиЗапросаНаВыгрузку =  НастройкиДатаОтправкиЗапросаНаВыгрузку;
			
			Настройки.Удалить("ТипОтбораЗапросНаВыгрузку");
			
		КонецЕсли;
		
		УстановитьОтборЗапросНаВыгрузку();
		
		Настройки.Удалить("ТипОтбораЗапросНаВыгрузку");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПричинаДобавленияОбъектыКЗагрузке" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияНавигационнойСсылки(Ключ, Представление, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НавигационнаяСсылка = НавигационнаяСсылкаФормы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ОбъектыМетаданныхОтборПриИзменении(Элемент)
	
	УстановитьОтборТипМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РаботаСРезультатамиОбменаКлиент.МножественныйОтборСпискаНачалоВыбора(ЭтотОбъект,
	                                                                     Элемент,
	                                                                     ОбъектыМетаданныхОтбор,
	                                                                     Неопределено,
	                                                                     НСтр("ru = 'Выбранные типы объектов'"),
	                                                                     ДоступныеДляОтбораТипыОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОтбораЗапросНаВыгрузкуПриИзменении(Элемент)
	
	УстановитьОтборЗапросНаВыгрузку();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтправкиЗапросаНаВыгрузкуПриИзменении(Элемент)
	
	УстановитьОтборЗапросНаВыгрузку();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СписокОбъектКПолучению" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ВнешняяСсылкаНаОбъект) Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ТекущиеДанные.ВнешняяСсылкаНаОбъект);
		Иначе
			ОткрытьФормуПроблемы(ТекущиеДанные);
		КонецЕсли;
		
	Иначе
		
		ОткрытьФормуПроблемы(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПроблему(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФормуПроблемы(ТекущиеДанные)
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.РедактироватьПериод(Период, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектВИсточнике(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ПерейтиПоВнешнейСсылкеНаОбъектИзФормыСписка(ЭтотОбъект, "Список");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущиеДанные.ПолноеИмяОбъектаМетаданных) Тогда
		
		ВозможныеТипы = ВозможныеТипыОбъектовМетаданных(ТекущиеДанные.ОбъектФормата);
		
		Если ВозможныеТипы.Количество() = 1 Тогда
			
			РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствияВФормеСписка(ЭтотОбъект, "Список", , ВозможныеТипы[0].Значение);
			
		ИначеЕсли ВозможныеТипы.Количество() > 1 Тогда
			
			ПослеВыбораТипаСопоставляемогоОбъекта = Новый ОписаниеОповещения("ПослеВыбораТипаСопоставляемогоОбъекта", ЭтотОбъект);
			
			ПоказатьВыборИзМеню(ПослеВыбораТипаСопоставляемогоОбъекта, ВозможныеТипы, Элементы.УстановитьСоответствие);
			
		КонецЕсли;
		
	Иначе
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствияВФормеСписка(ЭтотОбъект, "Список", "ОбъектКПолучению");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область ИнициализацияФормы

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	УзелИнформационнойБазы = Параметры.УзелИнформационнойБазы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "УзелПланаОбмена", УзелИнформационнойБазы, Истина);
	НавигационнаяСсылкаФормы = РаботаСРезультатамиОбмена.НавигационнаяСсылкаФормыСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	РаботаСРезультатамиОбмена.УстановитьУсловноеОформлениеИдентификаторПолученногоОбъекта(СписокУсловноеОформление, "ОбъектКПолучению");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОбъектыМетаданных()
	
	ТипыПричин = Новый Массив;
	ТипыПричин.Добавить(Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта);
	
	ДоступныеДляОтбораТипыОбъектов =
		РегистрыСведений.ОбъектыКЗагрузке.ТипыОбъектовМетаданныхСПроблемами(УзелИнформационнойБазы, ТипыПричин);
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеОтбора

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранноеЗначение;
	УстановитьОтборПоПериоду();
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборПоПериоду()
	
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода",
		Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", 
		?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, КонецДня(Дата(3999, 12, 31)))); 
		
	Элементы.ДекорацияОтборПериод.Заголовок = ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания,);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборТипМетаданных()
	
	РаботаСРезультатамиОбмена.УстановитьОтборТипМетаданныхВСписке(Список, ОбъектыМетаданныхОтбор);
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборЗапросНаВыгрузку()
	
	ДатаОтправкиЗапросаМенее = Неопределено;
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	Если ТипОтбораЗапросНаВыгрузку = "НеОтправлялся" Тогда
		
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		                                                                        "ДатаОтправкиЗапросаНаВыгрузку",
		                                                                         Дата(1, 1, 1, 1, 1, 1),
		                                                                         ВидСравненияКомпоновкиДанных.Равно,
		                                                                         ,
		                                                                         Истина);
	
		Возврат;
	
	ИначеЕсли ТипОтбораЗапросНаВыгрузку = "ТриЧасаИБолее" Тогда
		
		ДатаОтправкиЗапросаМенее = ТекущаяДатаСеанса - 3* 60 * 60;
		
	ИначеЕсли ТипОтбораЗапросНаВыгрузку = "ДеньИБолее" Тогда
	
		ДатаОтправкиЗапросаМенее = ТекущаяДатаСеанса - 24* 60 * 60;
		
	ИначеЕсли ТипОтбораЗапросНаВыгрузку = "НеделяИБолее" Тогда
		
		ДатаОтправкиЗапросаМенее = ТекущаяДатаСеанса - 7 * 24* 60 * 60;
		
	ИначеЕсли ТипОтбораЗапросНаВыгрузку = "РанееУказаннойДаты" Тогда
		
		ДатаОтправкиЗапросаМенее = ДатаОтправкиЗапросаНаВыгрузку;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
	                                                                        "ДатаОтправкиЗапросаНаВыгрузку",
	                                                                         ДатаОтправкиЗапросаМенее,
	                                                                         ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
	                                                                         ,
	                                                                         ДатаОтправкиЗапросаМенее <> Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаМножественногоОтбораПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.Свойство("Элемент") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Элемент = Элементы.ОбъектыМетаданныхОтбор Тогда
	
		ОбъектыМетаданныхОтбор = Результат;
		УстановитьОтборТипМетаданных();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	Форма.Элементы.ДатаОтправкиЗапросаНаВыгрузку.Видимость = (Форма.ТипОтбораЗапросНаВыгрузку = "РанееУказаннойДаты");
	
КонецПроцедуры

#КонецОбласти

#Область ФормаПроблемы

&НаКлиенте
Процедура ОткрытьФормуПроблемы(ТекущиеДанные)
	
	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	
	ДанныеЗаписи.ПолученныйОбъект   = ТекущиеДанные.ОбъектКПолучению;
	ДанныеЗаписи.ПравилоКонвертации = ТекущиеДанные.ПравилоКонвертации;
	ДанныеЗаписи.ОбъектФормата      = ТекущиеДанные.ОбъектФормата;
	ДанныеЗаписи.УзелПланаОбмена    = УзелИнформационнойБазы;
	
	ОповещениеОЗакрытииФормыПроблемы = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПроблемы(
		ДанныеЗаписи, ЭтотОбъект, 
		ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта"), ОповещениеОЗакрытииФормыПроблемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПроблемы(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.УстановленоСоответствие Тогда
		
		ПроверитьБлокируемыеОбъектыФоновоеЗадание(Результат.ПолученныйОбъект, Результат.ОбъектФормата, УзелИнформационнойБазы, Результат.ИдентификаторФоновогоЗадания);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УстановкаСоответствия

&НаКлиенте
Процедура ПослеРучногоВыбораСоответствияИБ(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Действие = "ВопросЕслиСоответствиеЕсть" Тогда
		
		УжеСопоставленныеИдентификаторы = РезультатПроверкиВыбранногоСоответствия(Результат);
		
		Если УжеСопоставленныеИдентификаторы.Количество() > 0 Тогда
			
			РаботаСРезультатамиОбменаКлиент.ОткрытьФормуСоответствиеУжеУстановлено(ЭтотОбъект,
			                                                                       Результат,
			                                                                       УжеСопоставленныеИдентификаторы,
			                                                                       ДополнительныеПараметры,
			                                                                       УзелИнформационнойБазы);
			
		Иначе
			
			ОтразитьУстановленноеСоответствие(Результат,
			                                  ДополнительныеПараметры.ПолученныйОбъект,
			                                  ДополнительныеПараметры.ПравилоКонвертации,
			                                  ДополнительныеПараметры.ОбъектФормата);
			
		КонецЕсли;
			
	ИначеЕсли ДополнительныеПараметры.Действие = "УстановитьСоответствие" Тогда
		
		ОтразитьУстановленноеСоответствие(Результат, 
		                                  ДополнительныеПараметры.ПолученныйОбъект,
		                                  ДополнительныеПараметры.ПравилоКонвертации,
		                                  ДополнительныеПараметры.ОбъектФормата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьУстановленноеСоответствие(ВыбранныйОбъект, ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата)
	
	РезультатОтражения = РезультатОтраженияРучногоСопоставления(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы, ВыбранныйОбъект);
	
	Если РезультатОтражения.Успешно Тогда
		
		Элементы.Список.Обновить();
		ПроверитьБлокируемыеОбъектыФоновоеЗадание(ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы, РезультатОтражения.ИдентификаторФоновогоЗадания);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтражения.ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатПроверкиВыбранногоСоответствия(ВыбранныйОбъект)
	
	ДанныеПроверкиПИСО = Новый Структура;
	ДанныеПроверкиПИСО.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ДанныеПроверкиПИСО.Вставить("Ссылка",                 ВыбранныйОбъект);
	
	Возврат РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныеИдентификаторыПриложенияСоответствующиеСсылке(ДанныеПроверкиПИСО);
	
КонецФункции 

&НаСервере
Функция РезультатОтраженияРучногоСопоставления(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы, СсылкаНаОбъект)
	
	Возврат РаботаСРезультатамиОбмена.РезультатОтраженияРучногоСопоставления(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы, СсылкаНаОбъект);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьБлокируемыеОбъектыФоновоеЗадание(ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы, КлючФоновогоЗадания)
	
	ДлительнаяОперация = ДлительнаяОперацияПослеУстановкиСоответствия(
		УникальныйИдентификатор, 
		КлючФоновогоЗадания,
		ПолученныйОбъект,
		ОбъектФормата,
		УзелИнформационнойБазы);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияПослеУстановкиСоответствия(УникальныйИдентификатор, КлючФоновогоЗадания, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы)
	
	Возврат РаботаСРезультатамиОбмена.ДлительнаяОперацияПослеУстановкиСоответствия(
		УникальныйИдентификатор, КлючФоновогоЗадания, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		РаботаСРезультатамиОбменаКлиент.ОбработатьРезультатыВыполненияГрупповойКомандыВСпискеПроблем(Результат.АдресРезультата, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаСопоставляемогоОбъекта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствияВФормеСписка(ЭтотОбъект, "Список", , Результат.Значение);
	
КонецПроцедуры

&НаСервере
Функция ВозможныеТипыОбъектовМетаданных(ИмяОбъектаФормата)
	
	ПолученныеДанные = Обработки.РаботаСРезультатамиОбмена.ВозможныеТипыОбъектовМетаданныхПоИмениОбъектаФормата(УзелИнформационнойБазы, ИмяОбъектаФормата);
	
	ВозможныеТипыОбъектовМетаданных = Новый СписокЗначений;
	
	Для Каждого ВозможныйТип Из ПолученныеДанные Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ВозможныйТип);
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВозможныеТипыОбъектовМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя(),
		                                         Строка(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных)));
		
	КонецЦикла;
	
	Возврат ВозможныеТипыОбъектовМетаданных;
	
КонецФункции

#КонецОбласти

#КонецОбласти
